package com.kotdev99.android.week4_mini_assignment.sampledata

class Data {

	fun dataInitialize(): ArrayList<NewsItem> {
		val data = ArrayList<NewsItem>()

		data.apply {
			add(
				NewsItem(
					"버스 사용연한 1년 연장, 교체비 부담↓… 터미널엔 물류 등 편익시설 확대",
					"당정이 차고지 설치 가능지역 확대 등 전세버스 관련 규제를 개선하고, 버스 운수종사자 고용 지원사업을 확대하기로 했다. 터미널에는 창고·물류시설 등 다양한 편의시설이 들어설 수 있게 시설규제를 완화한다.\n" +
							"\n" +
							"정부와 국민의힘은 30일 당정협의회를 열고 이런 내용을 담은 '버스·터미널 서비스 안정화 방안'을 논의했다. 이 자리에는 박대출 여당 정책위의장과 백원국 국토교통부 2차관, 김정재 국토교통위원회 간사 등이 참석했다.\n" +
							"\n" +
							"이날 박 정책위의장은 \"전국 방방곡곡을 운행하며 국민 이동의 모세혈관과 같은 역할을 하는 버스·터미널이 운영 축소로 인해 서비스 수준도 따라 저하하는 악순환을 겪지 않도록 예방해야 한다\"며 \"이를 위해 규제 완화와 운영여건 개선 등 당정의 공동노력이 필요한 시기\"라고 말했다.\n" +
							"\n" +
							"당정에 따르면 현재 버스는 코로나19로 인해 승객이 대폭 감소한 이후 더딘 회복속도를 보이고 있다. 노선버스 승객은 2019년 1~5월 22억여 명이었으나 올해 같은 기간 17억 6000여 명으로 80% 수준에 머물고 있다.\n" +
							"\n" +
							"버스의 승객 감소는 터미널에도 영향을 미쳤다. 터미널 매표 수입은 2019년 1754억 원에서 매해 하락하기 시작해 올 1분기 292억 원으로 집계됐다. 2019년 수입의 16%에 그치는 수준이다. 같은 기간 이용객 수는 1억 7000여 명에서 2500여 명으로 대폭 하락했다.\n" +
							"\n" +
							"이에 당정은 버스 교통체계의 지속 가능성 확보와 국민 이동권 보장을 위해 다양한 대책을 추진해 나갈 방침이다. 추진 방향으로 △불필요한 규제 개선 △운영 안정성 확보 위한 기반 확충 △민간 자율적 서비스·편의개선 유도 등을 제시했다."
				)
			)
			add(
				NewsItem(
					"카카오모빌리티, 택시기사 자녀 코딩 교육 '주니어랩' 성료",
					"카카오모빌리티가 택시기사 청소년 자녀 대상 코딩 교육 프로그램인 주니어랩을 성황리에 마무리하고, 수료식을 개최했다고 28일 밝혔다.\n" +
							"\n" +
							"주니어랩은 카카오모빌리티가 기금을 마련하고 사회복지법인 아이들과미래재단과 공동 운영한 사회공헌 교육 프로그램이다. 택시기사 청소년 자녀들 성장 지원과 업계 상생을 목표로 코딩교육과 현장학습, 카카오모빌리티 개발자 멘토링 등을 진행했다. 지난달 19일부터 23명 학생들이 한 달간 참여했다.\n" +
							"\n" +
							"카카오모빌리티는 판교 사옥에서 19일 수료식을 개최하고, 주니어랩 프로그램을 이수한 학생들을 초청해 수료증과 교육 종료 후에도 코딩 학습을 이어갈 수 있는 코딩학습 교구, 주니어랩 굿즈 등을 수여했다." +
							"\n" +
							"또 코딩 교육 과제 결과물을 함께 공유하는 자리도 꾸렸다. 이밖에도 멘토링 세션을 통해 카카오모빌리티 개발자들과 질의응답 시간을 가졌다. 현장에 참여한 학생들은 주니어랩 현장학습 프로그램에서 만난 모바일 주행로봇, 자율주행 등 미래 모빌리티 기술 개발에 대한 호기심을 피력하고, 개발자로서 갖춰야 할 필수 역량 등 질문들을 이어나갔다." +
							"\n" +
							"류긍선 카카오모빌리티 대표는 “이번 주니어랩 교육 프로그램을 통해 청소년들에게 현장 체험과 교육 등 새로운 경험에 대한 기회를 제공하고자 했다”며 “국내 대표 모빌리티 기술 기업으로서 미래 세대에게 IT 기술 기반 생활 속 혁신 가능성을 선보인 동시에, 택시기사들과 파트너십을 견고히 하는 자리를 갖게 돼 기쁘다”고 말했다."
				)
			)
			add(
				NewsItem(
					"창원 시내버스 기사 여건 ‘개선’, 예산 부담·서비스 ‘글쎄’",
					"창원시가 수익성 높은 노선 중심의 요금 경쟁과 불친절 등을 개선하기 위해 도입한 시내버스 준공영제가 9월 1일 시행 2년을 맞는다.\n" +
							"\n" +
							"준공영제는 공공재 성격을 띠고 있으나 민간 영역에서 관리되던 시내버스에 공공성을 가미하기 위해 노선관리 권한은 시에서 가져오는 대신 버스운행에서 발생하는 적자는 업계의 투명한 경영을 전제로 재정지원을 통해 보전해 주는 제도다. 이 제도 도입 후 현금수입 관리와 운수 종사원의 퇴직금 등 안정성은 개선됐지만, 친절한 응대와 안전한 버스운행에는 시민들의 체감이 엇갈린다는 평가다." +
							"\n" +
							"◇경과= 시행 초기 시는 교통복지를 위해 계속해서 운행될 수밖에 없는 버스업계의 경영 합리성과 안정성을 확보하는 데 중점을 뒀다. 구체적으로 요금수입 경쟁 해소와 투명한 현금수입 관리, 퇴직급여 적립 정상화, 사모펀드 준공영제 진입 제재 등이다.\n" +
							"\n" +
							"이에 시는 준공영제를 시행 중인 9개 회사의 수입금을 공동으로 관리하고, 운송원가를 지급해 흑자구간 수입경쟁을 배제했다. 더불어 관리요원을 파견해 CCTV로 현금수입금을 상시 투명하게 살펴보고 있다. 특히 준공영제 시행 이전 버스업계 부채에서 가장 큰 비중을 차지하던 운수 종사원의 퇴직금 미적립 문제는 제도 시행과 함께 의무화해 2020년 29%에서 지난해 62%로 적립률이 증가했다.\n" +
							"\n" +
							"신교통추진단 관계자는 “전국적으로 문제가 되고 있는 사모펀드의 준공영제 버스업체 진입에 의한 배당문제는 배당제한 조건을 통해 사전에 진입 장벽을 설정하는 등 준공영제 운영의 안정성을 확보했다”고 설명했다.\n" +
							"\n" +
							"시는 시내버스의 편의성과 안전성을 확보하기 위해 친환경버스 도입과 안전예측시스템 도입, 친절기사 제도 시행 등을 추진하고 있다.\n" +
							"\n" +
							"◇변화= 요금경쟁에 따른 난폭운전을 개선하는 것도 준공영제의 도입 취지이지만, 종사자들의 친절한 응대와 안전한 버스운행 등 서비스 체감도는 이전과 달라지지 않았다는 평가다. 시 역시 난폭운전의 추이를 객관적으로 확인하기 어려워, 시에 접수된 민원을 기준으로 난폭운전 여부를 확인해 재정지원을 깎는 페널티를 부과하고 있다. 이에 성과 지표의 객관성을 높이기 위해 개선 용역을 진행 중이다.\n" +
							"\n" +
							"시는 오는 10월께 준공영제 운영위원회 심의를 열고, 개선한 평가지표를 확정해 내년도 서비스 평가를 할 계획이다.\n" +
							"\n" +
							"시내버스 이용 승객과 사고 건수는 코로나19에 따른 불안 영향으로 큰 차이를 보이지 않은 것으로 나타났다.\n" +
							"\n" +
							"2019년 22만1000여명이던 시내버스 일일 승객은 코로나19 팬데믹 첫해인 2020년 16만명, 2021년 16만2000여명으로 감소했다가 지난해 17만1000여명, 올해 7월까지 17만5000여명을 기록했다. 시내버스 사고는 2019년 931건, 2020년 740건, 2021년 719건, 2022년 733건, 올해 1~6월 311건 발생했다."
				)
			)
			add(
				NewsItem(
					"김태호 PD \"나영석 PD 연봉 40억 기사에 MBC 부사장 호출\"",
					"[서울=뉴시스] 신효령 기자 = 김태호 PD가 나영석 PD의 연봉 공개 기사에 얽힌 비화를 털어놨다.\n" +
							"\n" +
							"지난 27일 싱어송라이터 정재형이 운영 중인 유튜브 채널 '요정재형'에는 '요정 캐릭터 만들어준 태호랑 간만에 떠드는 무도 이야기'이라는 제목의 영상이 게재됐다.\n" +
							"\n" +
							"이날 정재형은 \"김 PD가 연출한 '무한도전'이 성인들에게 MBC 대표 유아 프로그램 '뽀뽀뽀'와 같은 존재였다.  모두 같은 걸 보고 똑같이 웃고 똑같이 회자됐다\"고 말했다. 김 PD는 \"사실 저도 놀랬던 게 MBC에 2001년 1월2일에 입사했는데, 당시 MBC 예능 PD가 50명 밖에 안된다고 했었다. KBS가 한 80명, SBS가 채 50명이 안된다. 그 이야기를 들어보면 200명이 안되던 예능 PD들이 전국민의 웃음과 음악을 책임지던 시절이었다\"고 회상했다.\n" +
							"\n" +
							"이후 정재형은 MBC를 김 PD에게 퇴사한 이유를 물었고, 김 PD는 \"2013년부터 이미 많은 제의가 있었다\"고 답했다. 이어 \"뭐 어던 데는 선배 PD가 같이 가자고 해서 '아유 저 못 가겠습니다'라고 했다. 무한도전이 제일 즐겁다. 대체할 수 있는 즐거움이 아닐 것 같다. 그랬더니 (제안한 쪽에서) '돈을 더 줄까'라고 했었다\"고 덧붙였다.\n" +
							"\n" +
							"김태호 PD는 나영석과 함께 스타 PD의 양대 산맥으로 꼽혔다. 대표작으로는 '무한도전'(2006~2018), '놀면 뭐하니?'(2019~2022) 등이 있다." +
							"\n" +
							"아울러 김 PD는 \"한 번은 나영석 PD가 연봉 얼마 받았는지 기사가 난 날이었다. 그날 딱 기사를 보고 MBC에 출근했다. 갑자기 부사장실에서 '너 이따가 회사 오면 잠깐 들려라'라는 전화가 왔다\"고 당시 상황을 전했다. 이어 \"그런 상황이면 되게 자꾸 상상하게 되지 않나. 택시를 타고 가는데 상암동 가는 시간이 너무 길게 느껴졌다\"고 밝혔다.\n" +
							"\n" +
							"김 PD는 \"그래서 딱 갔는데 막 이런저런 얘기 하시다가 '기사 봤니?' 해서 기사 봤다고 말하고 답을 기다리고 있었다. 한참 정적이 흐르다가 '흔들리지 마'라고 하시더라. 제가 불만을 제기한 적도 없었는데\"라고 밝혀 웃음을 자아냈다. 정재형은 \"MBC에 있었던 이야기들이 되게 즐겁고 행복한 시간이었던 것 같다\"고 말했다.\n" +
							"\n" +
							"김 PD는 \"'무한도전'이 끝나고 '놀면 뭐하니'를 준비하던 기간도 사실 생각해보면 입사해서 18년 만에 처음으로 제 프로그램을 기획해볼 기회를 가진 것\"이라고 털어놨다. \"근데 그 상황에서 '무한도전'을 들어가는 게 좀 이상할 것 같았다. 만약에 뭘 했다가 안되면 (무한도전을) 가도 좋으니 한번 준비할 수 있는 기회를 달라고 해서 그때 이것저것 준비하다가 '놀면뭐하니'까지 갔던 것\"이라고 했다.\n" +
							"\n" +
							"또 김태호는 MBC를 퇴사하게 된 이야기도 전했다. 그는 \"지난해 1월 중순 MBC에서 퇴사했는데, 미리 회사에다가 '올해까지만 하고 나가겠다'고 이야기했다. 퇴사하기 5개월 전에 말한 상황이다. 사실 나쁜 감정으로 나온 회사도 아니고 지금도 제일 좋아하는 회사\"라고 강조했다."
				)
			)
			add(
				NewsItem(
					"버스 기사의 응급처치로 교통사고 환자 의식 되찾아",
					"버스 기사가 교통사고를 목격하고 환자를 신속히 응급처치해 의식을 되찾게 한 사실이 뒤늦게 확인됐습니다.\n" +
							"\n" +
							"지난 28일 오전 10시쯤 세종시 보람동 중앙버스전용차로에서 무단횡단하던 50대 여성이 버스에 치인 뒤 의식을 잃고 쓰러졌습니다.\n" +
							"\n" +
							"이 여성은 머리를 심하게 다쳤으며, 반대편 도로에서 이를 목격한 세종도시교통공사 소속 버스 기사 김영우 씨가 버스를 세우고 달려가 응급처치를 진행했습니다.\n" +
							"\n" +
							"신속한 응급처치로 이 여성은 119구급대가 도착하기 전에 의식을 되찾았으며, 현재는 병원 중환자실에서 회복 중인 것으로 전해졌습니다.\n" +
							"\n" +
							"김 씨는 이전에도 절도범을 잡거나 사람 목숨을 구한 적이 있어서 시민 영웅으로 인정받은 적이 있으며, 환자가 의식을 되찾자 다시 버스로 돌아가 운행을 재개했습니다."
				)
			)
			add(
				NewsItem(
					"中 취업난 속 흑기사로 떠오른 BYD…올해 3만여명 신규 채용",
					"29일 중국 구인·구직 사이트 례핀에 따르면 올해 1분기 대학 졸업자 신규 채용이 가장 많이 증가한 분야는 인공지능(AI)이었으며, 신에너지차가 그 뒤를 이었다.\n" +
							"\n" +
							"AI 분야의 전년 동기 대비 대졸자 채용 증가율은 172.5%에 달했고 신에너지차업계 신규 채용은 93.9% 늘었다." +
							"\n" +
							"다만 AI 분야의 채용 인력이 많지 않아 대졸 구직자들의 취업에 실질적인 도움을 주는 것은 고용 규모가 큰 신에너지차업계라고 현지 매체들은 전했다.\n" +
							"\n" +
							"석사 졸업자의 경우 신에너지차업계 채용 인력은 작년 동기보다 151% 증가, 전체 업계 채용 증가율 1위에 오르기도 했다.\n" +
							"\n" +
							"특히 중국의 전기차 선두 업체로, 올해 경제 불황에도 급속한 성장세를 이어가는 비야디의 채용 확대가 두드러졌다." +
							"\n" +
							"비야디는 올해 대졸자 이상 학력자 3만1천800명의 신규 채용에 나섰으며, 이 중 석·박사 비중이 61.3%에 달해 고학력자 취업난 해소에 단비 역할을 하고 있다.\n" +
							"\n" +
							"비야디는 이들 신규 채용 인력의 80.8%를 연구개발(R&D) 분야에 투입할 예정이다.\n" +
							"\n" +
							"비야디의 전체 고용 인력은 60만명으로, 3년 연속 글로벌 자동차 판매 1위를 차지했던 도요타보다 20여 만명 더 많은 것으로 나타났다.\n" +
							"\n" +
							"비야디는 작년 186만대를 판매, 테슬라를 제치고 신에너지차 판매 분야 세계 1위에 오른 데 이어 올해 상반기 125만대를 팔아 전년 동기 대비 96% 증가하며 세계 전체 차량 판매 10위 기업에 올랐다.\n" +
							"\n" +
							"비야디의 질주 속에 중국 신에너지차의 올해 1∼7월 누적 판매는 389만대로, 전년 동기 대비 32.5% 늘었고, 수출은 63만6천대로 1.5배 증가했다."
				)
			)
			add(
				NewsItem(
					"기사 빼가는 챗GPT에 영미권 언론 '퇴짜'…접속조차 못하게 막았다",
					"앞으로 생성형 인공지능(AI) 채팅로봇인 '챗GPT'를 이용해 기사를 간접적으로 접하기 점점 어려워질 것으로 보인다. 영미권 언론들이 앞다퉈 저작권 침해를 이유로 챗GPT의 자사 웹사이트 접속을 차단했기 때문이다.\n" +
							"\n" +
							"언론사 웹사이트 조회수가 광고수익과 직결된 만큼 독자들의 발걸음을 돌리게 하는 챗GPT를 더는 좌시할 수 없다는 판단으로 풀이된다." +
							"\n" +
							"영국 일간 가디언에 따르면 25일(현지시간) 챗GPT의 정보수집 도구인 'GPT봇'(GPTBot) 접속이 차단된 언론사 웹사이트는 뉴욕타임스(NYT), CNN방송, 로이터통신, 시카고 트리뷴, 호주 공영방송(ABC), 캔버라 타임스 등이다.\n" +
							"\n" +
							"AI 콘텐츠 정보제공 업체 '오리지널리티.AI'도 지난 22일 기준 전 세계 상위 사이트 100곳 가운데 15% 이상이 GPT봇의 접근을 막았으며 이 가운데 상당수는 언론사라고 분석했다.\n" +
							"\n" +
							"GPT봇은 챗GPT 개발사인 오픈AI가 지난 9일 공개한 온라인 정보수집 도구(웹 크롤러)로 대규모언어모델(LLM) 학습에 사용된다. 오픈AI는 GPT봇을 선보이면서 이러한 정보수집을 원치 않는 사이트 소유자에게 GPT봇의 접근을 차단하는 방법도 함께 안내했다." +
							"\n" +
							"언론사들은 기존의 챗GPT가 기사 내용을 무단으로 발췌해 사용자의 질문에 대답하거나 LLM 학습에 사용했기 때문에 GPT봇 차단은 불가피했다고 밝혔다. 로이터 대변인은 가디언과의 인터뷰에서 \"지식재산권은 언론 사업의 생명줄이나 다름없기 때문에 콘텐츠 저작권을 보호하는 것은 필수적\"이라고 말했다.\n" +
							"\n" +
							"NYT도 대변인을 통해 최근 서비스 약관을 업데이트해 \"AI 훈련 및 개발을 위한 콘텐츠 발췌를 금지했다\"고 전했다. 지난 3일부터 시행된 NYT 약관에는 \"기계 학습 또는 AI 시스템 훈련을 포함해 모든 소프트웨어 프로그램을 개발하는 과정에서 게시자의 콘텐츠를 동의 없이 사용해선 안 된다\"고 명시됐다.\n" +
							"\n" +
							"언론 업계는 AI 챗봇을 활용한 검색이 증가함에 따라 사용자들이 온라인 기사에 접속할 필요가 없게 되는 점을 가장 우려하고 있다. AI 챗봇이 사안과 관련된 기사를 종합해 줄글 형태로 요약 정리해 주기 때문이다. 자사 홈페이지 방문자 수는 언론사 광고 수익과도 직결되는 문제라 민감할 수밖에 없다.\n" +
							"\n" +
							"NYT의 모회사 뉴스 코퍼레이션의 로버트 톰슨 최고경영자(CEO)는 지난 5월 세계뉴스미디어 총회 기조연설에서 \"AI가 생성한 콘텐츠로 인해 독자가 언론사 홈페이지에 발길을 끊으면 저널리즘을 치명적으로 훼손할 수 있다\"며 \"극심한 수익 압박과 불확실한 거시 경제 상황에 대비해야 한다\"고 경고했다."
				)
			)
			add(
				NewsItem(
					"도로공사, 고속도로 역주행 사고 막은 버스기사 표창",
					"[대구=뉴시스] 박홍식 기자 = 한국도로공사 대구경북본부는 고속도로 역주행 차량을 막아 대형사고를 예방한 버스기사에게 표창장을 줬다.\n" +
							"\n" +
							"26일 도로공사에 따르면 지난 20일 오후 11시 57분께 경부선 서울방향 왜관 근처에서 갓길을 역주행하는 승용차가 있다는 제보가 접수됐다.\n" +
							"\n" +
							"도로공사는 전 구간 도로전광표지를 통해 역주행차량 발생을 알렸고, 신속한 안전조치를 위해 고속도로 순찰대와 도공 안전순찰원이 현장으로 출동했다.\n" +
							"\n" +
							"다행히 역주행 중인 차량을 발견한 한 버스기사가 기지를 발휘해 역주행 차량을 막아섰고, 고속도로 순찰대가 도착하기까지 6분간 진행을 저지했다.\n" +
							"\n" +
							"도로공사는 역주행 사고를 막아낸 버스기사 강태규(27)씨에 대해 표창과 함께 포상금을 줬다." +
							"\n" +
							"올해 고속도로 역주행으로 전국에서 7명의 사망자가 발생했고, 이는 과거 5년 평균 사망자 2명을 크게 상회하는 수치로 운전자들의 각별한 주의가 요구된다.\n" +
							"\n" +
							"전형석 대구경북본부장은 \"앞으로도 모범적 선행을 실천한 숨은 영웅들을 찾아 격려하고, 고속도로의 안전을 위해 노력하겠다\"고 말했다.\n"
				)
			)
			add(
				NewsItem(
					"[기획] 5월은 어른이날, 내가 그렇게 정했다! 나를 위한 로지텍 제품은?",
					"여러분들의 어린이날은 언제까지 였나요? 혹시 저처럼 중2병을 바르게 앓지 못하고 부모님께 외친 \"난 이제 어린이가 아니야!\"가 마지막은 아니셨는지요? 기념일을 잘 챙기는 가족 분위기 특성상 눈치 슬슬 봐가며 잘 흘러갔으면 대학생 때까지 선물을 받을 수 있었을 것 같은데, 참으로 후회가 되는 과거네요. 그래도 공휴일이라는 본질은 사라지지 않아서 다행입니다.\n" +
							"\n" +
							"요즘은 이러한 공휴일도 결혼을 하고나니 온전히 즐기기가 어렵습니다. 분명 20대 땐 전날 밤을 새우고 느지막이 일어나 여유를 즐기는 날이었는데. 이젠 명절 시즌만 다가오면 시간에 쫓겨 사는 삶이 되어버렸습니다. 물리적으로 멀어진 가족들과 오랜만에 모이면 분명 만날 땐 좋은데, 집으로 돌아오며 나만의 시간을 곰곰히 생각해보면 얼마 안되는 것 같기도 하고요.\n" +
							"\n" +
							"대신 좋은 점도 있습니다. 주위 사람들을 챙겨야 되다 보니 국내의 기념일들이 어떤 날인지를 좀 더 깊게 알게 되고, 그날에 맞는 무언가를 하게 됩니다. 가장 가까운 예시로는 '어린이날이니까 조카에게 선물 주러 가야지'같은 느낌으로 말이죠. 어찌 보면 너무도 당연한 기념일들을 휴일로만 탕진했던 나날이 그립.. 아니 아쉽게 느껴졌습니다.\n" +
							"\n" +
							"또 하나, 소중한 나를 위한 기념일이 없는 것도 참으로 아쉽습니다. 물론 생일이라는 특별한 기념일이 존재하지만 5월 내내 나를 제외한 주위 사람들, 심지어 스승의 날까지 챙기다 보면 \"나를 위한 선물은 대체 언제?\"라는 생각이 주마등처럼 머릿속을 스치더라고요. 나도 줘" +
							"\n" +
							"이 타이밍에 이놈의 컴퓨터는 어찌나 제 맘을 잘 읽는지, 집안 어린이들의 선물을 고르다보니 검색했던 알고리즘들이 모두 PC에 관련된 주변기기나 하드웨어쪽으로 추천해줬습니다. 그중에 가장 많이 추천을 받은 제품은 컴퓨터를 사용해봤다면 안써봤을리 없을 주변기기 브랜드 로지텍(Logitech). 요즘은 십 대 아니 그 밑 한자리수의 어린이들도 컴퓨터를 많이 사용하더라고요.\n" +
							"\n" +
							"그럼 지금부터 본격 어린이는 물론 어른이까지 책임져줄 로지텍 제품들을 제 경험을 바탕으로 간략히 소개하고자 합니다."
				)
			)
			add(
				NewsItem(
					"원신, 2023년 세계 모바일게임 최고 매출 '리니지 상위권'",
					"센서타워가 발표한 2023년 모바일 리포트 결과, 최고 매출을 기록한 모바일게임은 원신으로 집계되었으며 3종의 리니지 시리즈가 3위, 5위, 6위를 기록했다.\n" +
							"\n" +
							"리니지M을 필두로 리니지W, 리니지2M은 각각 3위, 5위, 6위에 올랐다. 컴투스의 서머너즈 워(Summoners War)는 7위에, 위메이드의 나이트 크로우(Night Crows)는 8위에, 그리고 넷마블의 ‘일곱 개의 대죄(The Seven Deadly Sins)’가 10위에 오르며 한국 퍼블리셔가 서비스하는 어드벤처 테마 모바일게임이 매출순위 절반 이상을 차지했다.\n" +
							"\n" +
							"나이트 크로우는 성장 순위 1위에 올랐고 아키에이지 워, 프라시아 전기, 서머너즈워 크로니클 등이 두각을 나타냈다.\n" +
							"\n" +
							"왕자영요(Honor of Kings)와 배틀그라운드 모바일(PUBG MOBILE) 등으로 대표되는 모바일 아레나 게임은 높은 인앱 구매 수익을 올린 테마로, 2023년 1월부터 7월까지 전 세계에서 47억달러 이상의 수익을 기록했다. 어드벤처 테마 모바일 게임이 그 뒤를 바짝 쫓았는데 2023년 1월부터 7월까지 전 세계에서 아레나 테마와 동일한 47억달러 이상의 수익을 올렸다. 대표적인 모바일 게임으로는 원신(Genshin Impact)과 ‘리니지M(Lineage M)’ 등이 있다.\n" +
							"\n" +
							"2023년 1월부터 7월까지 ‘Going Balls’와 ‘Bridge Race’로 대표되는 하이퍼캐주얼 테마의 모바일 게임은 23억 건에 육박하는 다운로드 수를 기록하며 전 세계에서 가장 많이 다운로드된 모바일 게임 테마가 됐다. ‘Ludo King™’, ‘Block Blast Adventure Master’ 등 실제 테이블탑 게임을 시뮬레이션한 테이블탑 테마의 모바일 게임 다운로드 역시 2023년 1월부터 7월까지 전 세계에서 21억 다운로드를 기록할 만큼 우수한 성과를 냈다.\n" +
							"\n" +
							"동기간 전 세계 인기 모바일게임 테마별 인앱 구매 수익 및 전년 대비 성장률을 살펴보면, 게임 쇼 테마의 모바일 게임 수익이 ‘Eggy Party’의 폭발적인 인기에 힘입어 전년 대비 18배나 증가한 2억7000만달러를 돌파했다. 우주, 축구, 포스트 아포칼립스, 무기, 의료, 뱀 등의 테마의 모바일 게임 수익 성장률 역시 두드러졌다.\n" +
							"\n" +
							"무기 테마의 모바일 게임 다운로드 수가 전년 동기 대비 약 2배 증가하며 2억 건을 돌파하며 해당 테마의 모바일 게임의 다운로드 수 성장률이 가장 높았다. 무기 수집을 테마로 하는 모바일 캐주얼 게임 ‘Attack Hole’의 다운로드 수의 급증이 주요 동력이었다. ‘화이트 아웃 서바이벌(Whiteout Survival)’과 ‘프로즌 시티(Frozen City)’로 대표되는 포스트 아포칼립스 테마의 모바일게임의 다운로드 수도 전년 대비 81% 증가해 해당 테마의 시장 잠재력을 보여줬다.\n" +
							"\n" +
							"한국과 일본은 어드벤처, 2차원 와이푸, 축구와 같은 테마의 모바일게임 수익이 가장 높은 시장이었다. 미국은 돈/보물, 패션/뷰티/헤어, 꾸미기, 포스트 아포칼립스/좀비, 제국 건설 테마의 모바일 게임 수익이 가장 높은 시장이었으며 중국에서는 아레나 테마의 모바일게임 수익 점유율이 가장 높았다.\n"
				)
			)
			add(
				NewsItem(
					"\"머리 좀 써볼까?\" 스팀, 전략 게임 할인 축제",
					"[게임플] 세계 최대 전자 소프트웨어 유통망(ESD) 스팀이 전략 게임 팬들을 위한 세일 행사를 진행한다.\n" +
							"\n" +
							"28일(현지 시각)부터 시작된 이번 ‘스팀 전략 페스트’는 심도 있는 전략 게임을 기념하는 축제로, 건설·경영, 실시간 전략, 턴제 전략, 4X 등 다양한 종류의 전략 게임들에 대한 할인을 제공한다.\n" +
							"\n" +
							"이번 행사에선 반다이남코의 ‘슈퍼로봇대전’ 시리즈가 역대 최저가로 판매된다. 2017년 플레이스테이션4로 출시된 이후, 2019년 PC로 이식된 ‘슈퍼로봇대전 V’는 75% 할인되어 정상가 54,800원에서 75% 할인되어 13,700원에 판매된다. 최신작 ‘슈퍼로봇대전 30’은 60% 할인된 28,800원에 판매 중이다.\n" +
							"\n" +
							"올해 5월 출시된 ‘전장의 푸가 2’도 출시 후 처음으로 할인되어 45,360원에 판매 중이다. 이와 함께 한국의 개발사 댄디라이온에서 개발한 SRPG ‘트러블슈터: 버려진 아이들’은 지난 6월 이후 조금씩 할인율을 높여 이번 행사에선 52% 할인된 12,480원에 판매되고 있다.\n" +
							"\n" +
							"이 외에도 이번 행사에선 ‘전국닌자 스토리’ ‘백화점 스토리’ 등의 카이로소프트의 경영 육성 게임들도 역대 최저가를 기록했으며, '바바 이즈 유', ‘문명 6’, ‘프로스트펑크’, ‘라이브러리 오브 루이나’ 등의 인기 게임들도 최저가로 판매되고 있다.\n" +
							"\n" +
							"한편 이번 행사는 태평양 표준시 기준 9월 4일 오전 10시까지 진행된다."
				)
			)
			add(
				NewsItem(
					"[기자수첩] 근거도 논리도 후진 '게임 탓'", "혹시나 했는데 역시나였다. 또 게임 탓이다.\n" +
							"\n" +
							"최근 사회적 문제로 떠오른 묻지마 칼부림 사건의 원인으로 게임을 지목하는 기사가 8일 게재됐다. 해당 기사에 따르면 10대, 20대 청소년층이 주로 즐기는 국내 인기 상위 게임 10개 가운데 4개가 상대를 처치하는 FPS 장르라면서 이러한 게임들이 폭력성을 조장한다고 설명하고 있다.\n" +
							"\n" +
							"그러면서 2001년 대한가정학회지가 발표한 '남자 청소년의 컴퓨터 게임 이용과 공격성'과 2013년 중앙대병원 정신건강의학교실 발표한 '게임의 공격성' 논문을 예시로 들면서 \"잔인한 게임에 많이 노출될수록 실제 공격성도 높아지는 경향이 있다는 연구 결과들이 적지 않다\"고 덧붙였다.\n" +
							"\n" +
							"하지만 논문과 연구 결과들이 게임과 폭력성의 인과관계를 증명한다는 해당 기사의 논조는 선뜻 동의하기 어렵다. 반대로 게임과 폭력성은 연관이 없다는 논문도 적지 않기 때문이다. 올 초 스탠포드 대학의 브레인스톰 연구소의 발표가 대표적이다. 해당 발표는 미국 내 총기 난사 사건의 원인으로 게임이 지목된 것에 대해서 게임이 정말 총기 난사에 영향을 끼쳤는지를 조사한 내용이다.\n" +
							"\n" +
							"브레인스톰 연구소는 몇 달에 걸쳐서 비디오 게임과 폭력적인 행동 사이에 인과관계가 있는 모든 연구와 해당 분야의 문헌 등을 포함한 82개의 의학 연구 논문을 검토했고 그 결과 비디오 게임과 총기 난사 사이의 인과관계를 발견하지 못했다고 결론을 내렸다.\n" +
							"\n" +
							"실제로 브레인스톰 연구소가 조사한 바에 따르면 비디오 게임이 폭력성을 조장한다면 비디오 게임 등장 전후로 범죄율에도 변화가 생겨야 하는데 이에 대해서 어떠한 증거도 찾지 못했다고 덧붙이면서 오히려 인기 있고 폭력적인 비디오 게임이 출시하면 역으로 폭력 범죄가 감소하는 경향을 보였다며, 폭력적인 감성의 배출구 역할을 할 수도 있다는 가설을 세웠을 정도다.\n" +
							"\n" +
							"비단, 논문만의 문제가 아니다. 해당 기사를 보면 여러모로 비약으로 가득 찬 걸 볼 수 있다. 유저와의 인터뷰가 대표적이다. \"상대 팀을 많이 죽여 이기고 있을 땐 기분이 확 좋아진다\"는 문구는 얼핏 사이코패스와도 같은 인상을 안겨준다. 하지만 서로 상대를 처치함으로써 승수를 올리는 게임에서 이기고 있는데 당연히 기분이 좋을 수밖에 없다. 이기니까 재미있는 거지 상대를 처치해서 재미있는 게 아님에도 교묘하게 의도를 왜곡하는 문구다.\n" +
							"\n" +
							"이러한 행태는 지난 2001년 KBS 아침마당에 출연한 임요환 선수에게 모욕적인 인터뷰를 했던 당시를 떠올리게 한다. 프로게이머로서 남부럽지 않은 활약을 펼치고 있던 임요환 선수에게 \"PK를 하면 오프라인에서도 상대를 죽이고 싶은 기분이 드느냐\"는 말도 안 되는 질문들이 이어졌다. 그로부터 22년이 흘렀다. 10년이면 강산도 바뀐다는 말이 있건만, 모든 사회적 문제의 원인이 게임이라는 분위기는 아직도 바뀌지 않은 모양이다."
				)
			)
			add(
				NewsItem(
					"드래곤플라이 \"4년만에 지스타 참가…B2B관서 신작 게임 공개\"",
					"(서울=연합뉴스) 김주환 기자 = 국내 게임사 드래곤플라이[030350]는 게임 사업 확장을 위해 오는 11월 부산에서 개막하는 게임쇼 지스타(G-STAR) B2B(기업 간 거래)관에 참가한다고 29일 밝혔다.\n" +
							"\n" +
							"드래곤플라이는 현재 엔트런스와 공동 개발 중인 다중접속역할수행게임(MMORPG) '프로젝트 C', 서브컬처(일본 애니메이션풍) 방치형 게임 '프로젝트 W', 서브컬처 역할수행게임(RPG) '프로젝트 N' 등을 개발 중이다.\n" +
							"\n" +
							"드래곤플라이는 이 중 하반기 출시 예정인 신작을 지스타 B2B관에서 공개하고, 신사업으로 추진 중인 게임형 디지털 치료 기기인 '가디언즈 DTx'도 함께 선보일 예정이다." +
							"\n" +
							"드래곤플라이 관계자는 \"다양한 장르 게임과 IP 사업다각화에 나선 만큼, 새로운 투자처 및 협업 파트너를 확보하여 회사의 명성을 다시 회복할 수 있었으면 좋겠다\"고 말했다."
				)
			)
			add(
				NewsItem(
					"메타는 왜 안드로이드 앱을 코틀린으로 다시 짜나",
					"메타는 페이스북, 인스타그램, 메신저, 포탈, 퀘스트VR 등의 안드로이드 앱의 코드를 자바에서 코틀린으로 전환하고 있다. 수천명 개발자를 투입해 진행하는 코틀린 전환 프로젝트에 대해페이스북 내 개발자가 직접 해당 작업의 경험을 공유했다.\n" +
							"\n" +
							"최근 미국지디넷은 페이스북 소프트웨어 엔지니어인 오메르 스트룰로비치의 블로그 글을 소개했다.[블로그 바로가기]\n" +
							"\n" +
							"오메르 스트룰로비치 엔지니어는 \"현재 안드로이드 개발에 사용하는 자바를 코틀린으로 전환하는 것은 사소한 일이 아니다\"라고 밝혔다.\n" +
							"\n" +
							"그는 \"오늘날 페이스북, 메신저, 인스타그램 등의 안드로이드 앱은 각각 100만줄 이상의 코틀린 코드를 갖고 있으며 전환율은 증가하고 있다\"며 \"전체적으로 안드로이드 코드베이스에 1천만줄 이상의 코틀린 코드가 있다\"고 밝혔다." +
							"\n" +
							"안드로이드 운영체제용 앱은 자바를 주요 언어로 삼아 개발돼 왔다. 오라클이 안드로이드 OS에 대해 자바 API 저작권 소송을 제기하면서, 구글은 자바를 대체할 주요언어를 다수 물색했다. 코틀린은 여러 후보 중 선택된 공식 1순위 개발언어다.\n" +
							"\n" +
							"그는 코틀린의 장점으로 네가지를 들었다. 'Null' 허용 여부를 코틀린에서 기본적으로 제공한다는 점, 실행 속도를 저하시키지 않으면서 함수형 프로그래밍을 사용할 수 있다는 점, 더 짧은 코드를 작성할 수 있다는 점, 도메인 특화 언어(SDL)를 정의할 수 있다는 점 등이다.\n" +
							"\n" +
							"그러나 신생언어인 코틀린은 여전히 세계 3위권 개발언어인 자바보다 대중성에서 처진다. 개발언어의 대중성은 단순한 인기 측면보다 활용하기 좋은 보조도구를 확보하기 얼마나 용이한가에 더 영향을 준다. 메타가 안드로이드 앱을 코틀린으로 전환하는 것은 그 코드의 규모를 감안할 때 상당한 도전이다.\n" +
							"\n" +
							"스트룰로비치는 대규모 앱의 코틀린 전환에서 나타나는 두가지 단점을 설명했다.\n" +
							"\n" +
							"우선, 코틀린은 자바보다 대중적이지 않기 때문에 더 적은 도구가 존재한다는 점이다. 또 코틀린과 자바의 상호운용성을 고려하는 도구는 복잡하다. 메타는 언어의 100% 상호운용성에도 모든 자바를 제거할 수 없다는 사실을 알게 됐다.\n" +
							"\n" +
							"스트룰로비치는 \"코틀린은 인기있는 언어지만, 자바와 비교할 때 인기 격차는 분명하다\"며 \"자바는 세계에서 2, 3위 인기 언어고, 이는 코틀린이 더 적은 도구만 쓸 수 있다는 뜻\"이라고 설명했다.\n" +
							"\n" +
							"그는 \"그보다 더 나쁜 건 모든 코틀린 도구가 자바와 상호운용성을 계산해야 하고, 채택을 복잡하게 만든다는 점\"이라고 지적했다.\n" +
							"\n" +
							"메타가 툴의 부족보다 더 우려하는 건 코틀린의 느린 빌드 속도다.\n" +
							"\n" +
							"스트룰로비치는 \"코틀린의 빌드 시간은 자바보다 더 길다는 것은 처음부터 알고 있었다\"며 \"언어와 생태계는 더 복잡하고, 자바는 컴파일러 최적화를 20년 앞서 시작했다\"고 적었다.\n" +
							"\n" +
							"그는 \"메타는 여러 대형 앱을 갖고 있기 때문에 빌드 시간은 개발자의 경험에 부정적 영향을 미칠 수 있다\"고 덧붙였다.\n" +
							"\n" +
							"그는 HTTP 클라이언트 프로젝트인 'OkHttp'가 2019년 자바에서 코틀린으로 전환된 후 컴파일 시간을 예로 들었다. OkHttp는 2만4천줄의 코틀린으로 작성된 상대적으로 소규모 프로젝트다. 자바의 경우 컴파일 시간이 2.4초였지만, 코틀린 컴파일 시간은 10.2초였다.\n" +
							"\n" +
							"스트룰로비치는 \"코틀린으로 마이그레이션은 놀라울 정도로 쉽고, 매우 복잡하다\"고 밝혔다. 그는 \"코틀린 설계는 세심한 상호운용성을 통해 자바에서 간단하게 변환할 수 있어 쉽다\"며 \"이 디자인을 통해 젯브레인스는 안드로이드스튜디오와 함께 '자바투코틀린' 변환기인 'J2K'를 커뮤니티에 제공할 수 있었다\"고 적었다.\n" +
							"\n" +
							"이어 \"그러나 J2K가 항상 정확한 건 아니며, 자바와 코틀린의 상호운용성은 몇가지 극단적 경우를 노출한다\"고 덧붙였다.\n" +
							"\n" +
							"메타는 자바 코드를 남기고 새로 작성되는 코드만 코틀린으로 작성하는 방법을 택하지 않았다. 거의 모든 코드를 코틀린으로 전환하는 게 메타의 결정이었다. 비교하자면 리눅스커널과 안드로이드 오픈소스 프로젝트(ASOP)는 러스트를 코드베이스에 도입하기로 결정했다.\n" +
							"\n" +
							"스트룰로비치는 신규 코드를 코틀린으로 작성하고 기존 자바 코드를 남겨두는 방식은 해야 할 작업을 줄이지만, 복잡성을 높읻다는 점을 강조했다.\n" +
							"\n" +
							"그는 \"코틀린과 자바 코드 간의 상호운용성 활성화하면 코틀린에 플랫폼 타입을 사용하게 한다\"며 \"플랫폼 타입은 코틀린 코드에서 제공하는 정적 안정성 대신 런타임 Null 포인터 역참조를 발생시켜 충돌을 일으킨다\"고 설명했다.\n" +
							"\n" +
							"그는 \"일부 복잡한 경우 코틀린의 null 검사 생략이 null을 허용하고, 나중에 null 포인터 예외를 생성할 수 있다\"며 \"코틀린 코드가 자바 인터페이스로 구현된 코틀린 인터페이스를 호출하는 경우 이런 상황이 발생한다\"고 덧붙였다.\n" +
							"\n" +
							"그는 또 다른 문제로 자바를 남겨둘 경우 코틀린의 장점을 개발자가 완전히 누릴 수 없다는 점을 들었다.\n" +
							"\n" +
							"코틀린 생태계에 있어 메타의 결정은 상당한 도움이다. 메타는 깃허브에 사내에서 개발한 여러 코틀린 변환도구를 출시했다. 다른 코틀린 사용 개발자는 메타에서 공개한 도구를 직접 사용할 수 있고, 혹은 전환을 자동화하는 좋은 방법을 찾도록 영감을 줄 수 있다.\n" +
							"\n" +
							"코틀린 채택은 규모에 비례해 작업의 어려움이 증가한다. 페이스북은 그레이들(Gradle)을 사용하는 인텔리J의 안드로이드 스튜디오 IDE 대신 자체적인 '벅(Buck)' 빌드 시스템을 사용한다.\n" +
							"\n" +
							"스트룰로비치는 메타에서 기여한 여러 오픈소스 코틀린 도구를 설명했다. 일례로 자바와 동등한 수준의 경험을 제공하기 위해 사용하는 'Pygments' 라이브러리가 있다. 메타는 또 구글-자바-포맷의 코드와 철학에 기반한 결정론적 코틀린 포맷터 'Kfmt'를 만들었다. 이 도구는 인텔리J 안드로이드스튜디오용 플러그인이다.\n" +
							"\n" +
							"몇가지 단점에도 메타가 코틀린 전환으로 거둔 성과는 코드베이스 규모의 감소다.\n" +
							"\n" +
							"스트룰로비치는 \"지금까지 메타의 코드베이스 크기가 평균 11% 감소했다\"고 밝혔다. 과거 구글홈 팀도 새로운 기능을 코틀린으로 이전할 때 앱의 코드베이스 크기를 33% 줄인다고 밝혔었다.\n" +
							"\n" +
							"그는 \"온라인에서 인용된 훨썬 더 많은 숫자를 봤지만, 이 숫자는 특정 예에서 파생된 것으로 보인다\"며 \"제거된 라인은 일반적으로 더 짧은 코틀린코드보다 암시적이지 않은 상용구 코드이기 때문에 현 숫자에 만족한다\"고 적었다.\n" +
							"\n" +
							"그는 이밖에 코틀린의 실행 속도를 자바와 동일하게 유지할 수 있다는 점을 확인했고, 빌드 크기 증가 문제를 해결할 방법을 찾았으며, 길어진 빌드 시간 문제를 개선하는 빌드 시스템을 만들었다는 점을 설명했다.\n" +
							"\n" +
							"코틀린은 인텔리J를 만드는 젯브레인스에서 처음 개발했다. 구글은 2017년부터 코틀린을 안드로이드 앱용 언어로 사용했으며, 구글과 젯브레인스는 2018년부터 코틀린재단의 코틀린 언어 개발을 지원하고 있다.\n" +
							"\n" +
							"구글의 안드로이드 팀은 2019년부터 '코틀린 퍼스트' 접근법을 채택했다. 구글 지도, 홈, 플레이, 드라이브, 메시지 등 코틀린으로 구축된 구글 안드로이드 앱은 70개를 넘는다. 구글은 코틀린에 대해 자바보다 더 효율적이고 안전하며, 더 작은 코드베이스를 생성하면서도 자바와 100% 상호운용 가능하다고 설명한다. 자바 코드베이스와 코틀린 코드베이스를 공존하게 해 자바에서 코틀린으로 전환을 더 쉽게 할 수 있다고도 한다.\n" +
							"\n" +
							"구글의 코틀린 제품매니저인 제임스 워드는 메타의 활동에 환영한다는 입장을 밝혔다."
				)
			)
			add(
				NewsItem(
					"삼성전자·구글 불화설 일축…안드로이드 백그라운드 앱 관리 솔루션 출시",
					"[더구루=홍성일 기자] 자체 폴더블폰 출시, 검색엔진 변경설 등으로 흔들리는 것으로 보였던 삼성전자와 구글가 백그라운드 앱 문제 해결을 위해 손을 잡았다. 구글은 삼성전자와 손잡고 균일한 백그라운드 앱 경험을 제공한다는 목표다. \n" +
							"\n" +
							" \n" +
							"\n" +
							"9일 관련 업계에 따르면 구글은 최근 안드로이드 개발자 블로그를 통해 백그라운드 앱 프로세스 문제를 해결하기 위한 첫번째 파트너십 삼성전자와 체결했다. \n" +
							"\n" +
							" \n" +
							"\n" +
							"이번 파트너십에 따라 삼성전자는 연말 출시될 예정인 원UI 6.0에 안드로이드14의 백그라운드 API 시스템을 도입, 균일한 백그라운드 환경을 제공하게 된다. 구글은 지난 2월 안드로이드 14를 공개했으며 현재 베타 서비스를 진행 중이다. 정식 출시 등의 상세 정보는 내달 열릴 개발자 컨퍼런스를 통해 공개된다. \n" +
							"\n" +
							" \n" +
							"\n" +
							"구글은 안드로이드 14에 백그라운드 프로세스와 관련해 포그라운드 서비스의 기준을 명확히하고 유저의 업로드, 다운로드 관리 환경도 원활하게 한다. 또한 변경사항에 대한 새로운 API 정책도 적용한다.\n" +
							"\n" +
							" \n" +
							"\n" +
							"포그라운드와 백그라운드 앱은 스마트폰 유저가 다른 앱을 실행하더라도 종료되지 않고 계속 실행된다는 특징이 있다. 두 서비스의 차이는 눈에 보이느냐 안보이느냐의 차이로 나눌 수 있다. 포그라운드 서비스는 음원 스트리밍 앱과 같이 작동하고 있다는 것을 확인할 수 있지만 백그라운드의 경우 작동은 하고 있지만 화면에는 표시되지 않는다. \n" +
							"\n" +
							" \n" +
							"\n" +
							"백그라운드 앱 처리방식 문제는 구글의 최대 골칫거리 중 하나였다. 구글은 백그라운드 프로세스에 대한 자체 기준을 세우고 있지만 제조업체 별로 장치의 배터리 효율성을 고려, 이를 조정해왔다. 그러다보니 백그라운드 앱 등의 일관성이 결여되고 강제로 종료되는 등 사용자 경험을 해친다는 문제가 있어왔다." +
							"\n" +
							"구글은 지난해 5월 개최된 연례 개발자 컨퍼런스 'Google I/O 2022'를 통해서도 이 문제를 직접적으로 거론했다. 구글 측은 \"제조업체와의 직접 협력을 강화해 백그라운드 앱 관리에 대한 일관성을 강화하고 표준화된 배터리 관리 기능을 구축해 제조업체가 자체적으로 최적화 할 필요가 없도록 노력하겠다\"고 밝힌 바 있다. \n" +
							"\n" +
							" \n" +
							"\n" +
							"또한 이번 파트너십 체결로 최근 불거진 삼성전자와 구글의 불화설은 사그라들 것으로 전망된다. 최근 업계에서는 구글이 자체 폴더블 스마트폰인 '픽셀 폴드' 출시하고 삼성전자가 스마트폰 기본 검색엔진을 마이크로소프트의 '빙'으로 교체할 것이라는 소문이 돌면서 두 회사의 동맹이 깨지는 것 아니냐는 목소리가 나오기도 했었다.  \n" +
							"\n" +
							" \n" +
							"\n" +
							"삼성전자 측은 \"안드로이드 플랫폼을 강화하기 위해 구글과 통합정책을 마련했다. 이를 통해 갤럭시 유저에게 더욱 일관되고 안정적인 사용자 경험을 제공할 수 있을 것\"이라며 \"원 UI 6.0 이후 포그라운드 서비스는 안드로이드의 새로운 포그라운드 서비스 API 정책에 따라 개발되는 한 개발의도에 따라 작동하도록 보장될 것\"이라고 말했다.  "
				)
			)
		}
		return data
	}
}